#language: ru
@дерево
@tree
@ExportScenarios
@IgnoreOnCIMainBuild

Функционал: экспорт сценариев

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: экспорт документов заказ покупателя с проведением документов

	И я проверяю или создаю для документа "Заказ" объекты:
		| 'Ссылка'                                                         | 'ПометкаУдаления' | 'Номер'     | 'Дата'                | 'Проведен' | 'Покупатель'                                                             | 'Склад'                                                             | 'Валюта'                                                            | 'ВидЦен'                                                             | 'Организация'                                                            | 'СостояниеЗаказа'              | 'Автор'                                                                   | 'Сумма' |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767a' | 'False'           | '000000001' | '24.06.2022 17:44:38' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710079' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bee7616e1' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' | 'Enum.СостоянияЗаказов.Закрыт' | 'e1cib/data/Справочник.Пользователи?ref=b344f46d042c176811ecf323ce38c538' | 2800    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767b' | 'False'           | '000000002' | '24.06.2022 17:45:13' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=8ca0000d8843cd1b11dc8d043d710079' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8c4c9d5c4221' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4225' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' | 'Enum.СостоянияЗаказов.Закрыт' | 'e1cib/data/Справочник.Пользователи?ref=b344f46d042c176811ecf323ce38c538' | 5700    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767c' | 'False'           | '000000003' | '24.06.2022 17:45:41' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8e8bd1cb82a8' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8b8bee7616e1' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' | 'Enum.СостоянияЗаказов.Закрыт' | 'e1cib/data/Справочник.Пользователи?ref=b344f46d042c176811ecf323ce38c538' | 2000    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767d' | 'False'           | '000000004' | '24.06.2022 17:52:04' | 'True'     | 'e1cib/data/Справочник.Контрагенты?ref=a9b000055d49b45e11db8e8bd1cb82a8' | 'e1cib/data/Справочник.Склады?ref=a9b000055d49b45e11db8c4c9d5c4221' | 'e1cib/data/Справочник.Валюты?ref=a9b000055d49b45e11db8c4421dda1c5' | 'e1cib/data/Справочник.ВидыЦен?ref=a9b000055d49b45e11db8c4c9d5c4226' | 'e1cib/data/Справочник.Организации?ref=8d34000d8843cd1b11dd2bea12f94c64' | 'Enum.СостоянияЗаказов.Закрыт' | 'e1cib/data/Справочник.Пользователи?ref=b344f46d042c176811ecf323ce38c538' | 3344    |

	И я перезаполняю для объекта табличную часть "Товары":
		| 'Ссылка'                                                         | 'Товар'                                                             | 'Цена' | 'Количество' | 'Сумма' |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767a' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 200    | 10           | 2000    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767a' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8d043d710077' | 20     | 20           | 400     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767a' | 'e1cib/data/Справочник.Товары?ref=8d3a000d8843cd1b11dd321ba7a30aaf' | 200    | 2            | 400     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767b' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8ea92d97a749' | 300    | 15           | 4500    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767b' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8f' | 40     | 15           | 600     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767b' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df4' | 40     | 15           | 600     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767c' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8eb360f70b4d' | 250    | 5            | 1250    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767c' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8d043d710077' | 25     | 10           | 250     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767c' | 'e1cib/data/Справочник.Товары?ref=8d3a000d8843cd1b11dd321ba7a30aaf' | 250    | 2            | 500     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767d' | 'e1cib/data/Справочник.Товары?ref=8ca1000d8843cd1b11dc8ea92d97a749' | 330    | 8            | 2640    |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767d' | 'e1cib/data/Справочник.Товары?ref=a9bc00055d49b45e11dbc8caefc3ed8f' | 45     | 8            | 360     |
		| 'e1cib/data/Документ.Заказ?ref=9474f46d042c176811ecf3c350bb767d' | 'e1cib/data/Справочник.Товары?ref=8ca0000d8843cd1b11dc8cfecc6a7df4' | 43     | 8            | 344     |
	
* Проведение документов Заказ покупателя	
 	И я выполняю код встроенного языка на сервере	
		| 'Документы.Заказ.НайтиПоНомеру("000000001").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'  |
		| 'Документы.Заказ.НайтиПоНомеру("000000002").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'  |
		| 'Документы.Заказ.НайтиПоНомеру("000000003").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'  |
		| 'Документы.Заказ.НайтиПоНомеру("000000004").ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'  |
	И пауза 10	