#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект> 

Сценарий: Локальные переменные
	И я запоминаю текущее окно как "ЗаголовокОкнаПоступлениеТоваров"
	И я вывожу значение переменной "ЗаголовокОкнаПоступлениеТоваров"
	Когда открылось окно 'Поступление товаров и услуг * от *'
	И я нажимаю на кнопку 'Движения документа'
	Тогда открылось окно 'Движения документа'
	И из выпадающего списка "Регистр" я выбираю точное значение 'R1001 Закупки'
	И я нажимаю на кнопку 'Сформировать'
	Тогда табличный документ "ResultTable" равен:
		| '$ЗаголовокОкнаПоступлениеТоваров$' | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''                        | ''                                     | ''                  |
		| 'Движения документа по регистрам'   | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''                        | ''                                     | ''                  |
		| 'Регистр  "R1001 Закупки"'          | ''                   | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                    | ''                        | ''                                     | ''                  |
		| ''                                  | 'Period'             | 'Resources'  | ''      | ''                  | ''             | 'Dimensions'             | ''                          | ''                             | ''       | ''                                                    | ''                        | ''                                     | 'Attributes'        |
		| ''                                  | ''                   | 'Количество' | 'Сумма' | 'Сумма без налогов' | 'Сумма скидки' | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Инвойс'                                              | 'Характеристика'          | 'Ключ строки'                          | 'Отложенный расчет' |
		| ''                                  | '22.07.2021 9:38:02' | '9'          | ''      | ''                  | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 2 от 22.07.2021 9:38:02' | 'Товар без характеристик' | '414cff43-632f-4b1e-b4e8-619473e3b3b6' | 'Да'                |
		| ''                                  | '22.07.2021 9:38:02' | '9'          | '773,1' | '644,25'            | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 2 от 22.07.2021 9:38:02' | 'Товар без характеристик' | '414cff43-632f-4b1e-b4e8-619473e3b3b6' | 'Нет'               |
		| ''                                  | '22.07.2021 9:38:02' | '9'          | '900'   | '750'               | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'en наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 2 от 22.07.2021 9:38:02' | 'Товар без характеристик' | '414cff43-632f-4b1e-b4e8-619473e3b3b6' | 'Нет'               |
		| ''                                  | '22.07.2021 9:38:02' | '9'          | '900'   | '750'               | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 2 от 22.07.2021 9:38:02' | 'Товар без характеристик' | '414cff43-632f-4b1e-b4e8-619473e3b3b6' | 'Нет'               |
		| ''                                  | '22.07.2021 9:38:02' | '9'          | '900'   | '750'               | ''             | 'Собственная компания 1' | 'Подразделение 1'           | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 2 от 22.07.2021 9:38:02' | 'Товар без характеристик' | '414cff43-632f-4b1e-b4e8-619473e3b3b6' | 'Нет'               |
	
 Сценарий: Глобальные переменные
	И я закрываю все окна клиентского приложения
	И я сохраняю навигационную ссылку текущего окна в переменную "$$СсылкаТоварБезХарактеристик$$"
	И Я открываю навигационную ссылку "$$СсылкаТоварБезХарактеристик$$"
	
	